/*************************************************************************************
* ファイル名　：　CommunicationTest.h
* タイトル　　：　INVADERパワーボードコマンド認識テスト用プログラム
* 製作者　　　：　宇佐美尚人
* 所属　　　　：　東京大学工学部電気電子工学科
* 製作日　　　：　2012.3.19
* 言語　　　　：　C
**************************************************************************************
* ※備考※
* H8との通信テスト(3/19実施)用です
*************************************************************************************/

#include "16F877.h"
#include "stdint.h"
#include "string.h"

#fuses HS,WDT
#use delay(CLOCK=20000000)
#use rs232(baud = 38400, xmit = PIN_C6, rcv = PIN_C7)

char tlg[11]="c-p-c-pwt ";
char send[11]="r-c-p-pwt-";
char rcvBuffer[50];
int8_t t;