/*************************************************************************************
* ファイル名　：　init.h
* タイトル　　：　INVADER初期化関数用ヘッダファイル
* 製作者　　　：　03-110317 木村元紀
* 所属　　　　：　東京大学工学部航空宇宙工学科
* 製作日　　　：　2012.5.10
* 言語　　　　：　C
**************************************************************************************
* ※備考※
*
*************************************************************************************/
#ifndef	INIT_H_
#define	INIT_H_

unsigned char Init_MyFunction(void);
unsigned char Init_Bus(void);
unsigned char Init_Peripherals(void);

#endif