/*************************************************************************************
* ファイル名　：　itu1.c
* タイトル　　：　INVADERタイマ(CH1)プログラム
* 製作者　　　：　03-110351 三好賢聖　03-110317 木村元紀
* 所属　　　　：　東京大学工学部航空宇宙工学科
* 製作日　　　：　2012.1.30
* 言語　　　　：　C
**************************************************************************************
* ※備考※
* H8内部タイマモジュール(ITU-CH0)
* 通信に関するスケジューリングを行う
* intimia0(): 10msec周期(100Hz)で割り込み処理を発生。
* H8外部クロックとしては25MHzを前提。
* 
*************************************************************************************/
#include "iodefine.h"
#include "inthandler.h"
#include "sci.h"
#include "global.h"
#include "timer.h"


/*************************************************
            ITU0初期化関数
--------------------------------------------------
* H8外部クロック16MHz
* GRAとのコンペアマッチでカウントクリア
*
*************************************************/
unsigned char itu0_init(void)
{
	ITU0.TCR.BIT.CCLR = 3;
	ITU.TSNC.BIT.SYNC0 = 0;
    ITU0.TCR.BIT.TPSC = 0x03;		//クロックを1/8 (3.125MHz)に設定　→　周期:0.32usec
	ITU0.TCR.BIT.CCLR = 2;			//デフォルトではGRBを用いる
    ITU0.TIOR.BYTE = 0x88;
    ITU.TISRA.BIT.IMIEA0 = 0x00;		//割り込み禁止
	ITU.TISRB.BIT.IMIEB0 = 0x00;
    ITU.TSTR.BIT.STR0 = 0;			//ITU0 TCNTカウントストップ
}


/*************************************************
            ITU0同期割り込み関数
--------------------------------------------------
* H8外部クロック16MHz
* 100Hzで割り込み発生
*
**************************************************/
void INT_IMIA0(void)
{
	ITU.TISRA.BIT.IMFA0 = 0;		//割り込みステータスフラグクリア
	ITU.TISRA.BIT.IMIEA0 = 0x00;	//IMFAフラグによる割り込み禁止
	timer_flag = 1;					//while文から抜けるためのフラグを立てる
}


/*************************************************
            ITU0同期割り込み関数
--------------------------------------------------
* H8外部クロック16MHz
* 100Hzで割り込み発生
*
**************************************************/
void INT_IMIB0(void) {
	ITU.TISRB.BIT.IMFB0 = 0;			//割り込みステータスフラグクリア
	ITU.TISRB.BIT.IMIEB0 = 0x00;		//IMFBフラグによる割り込み禁止
	timer_flag = 1;					//while文から抜けるためのフラグを立てる
}