/*************************************************************************************
* ファイル名　：　itu2.c
* タイトル　　：　INVADERタイマ(CH2)プログラム
* 製作者　　　：　03-120495 西山万里
* 所属　　　　：　東京大学工学部電気電子工学科
* 製作日　　　：　2012.6.4
* 言語　　　　：　C
**************************************************************************************
* ※備考※
* H8内部タイマ(ITU-CH2)
* intimia1(): 10msec周期(100Hz)で割り込み処理を発生。
* H8外部クロックとしては25MHzを前提。
* 
*************************************************************************************/
#include "itu2.h"
#include "iodefine.h"
#include "inthandler.h"

static volatile unsigned long itu2_cnt;    // 10msecの割り込み毎にインクリメント
static volatile unsigned long my_wdt; 	          // 10msecの割り込み毎にインクリメント mainloopを一回終えるとリセット

/*************************************************
            ITU2初期化関数
--------------------------------------------------
* H8外部クロック25MHz
* GRAとのコンペアマッチでカウントクリア
*
*************************************************/
unsigned char itu2_init(void)
{
	ITU.TSTR.BIT.STR0 = 0;                // カウント停止
	
	ITU2.TCR.BIT.CCLR = 1;                // GRAのコンペアマッチでカウントクリア
	ITU2.TCR.BIT.TPSC = 3;                // タイマプリスケーラ 25MHz/8=3.125MHz T=0.32[usec]
	ITU2.GRA = 31250-1;                   // 周期10ms
	
	itu2_cnt = 0;
	my_wdt = 0;
	
	ITU.TISRA.BIT.IMFA2 = 0;                // 割り込みステータスフラグクリア
	ITU.TISRA.BIT.IMIEA2 = 1;              // タイマ割り込み許可
	
	return 1;
}

/*************************************************
            ITU2スタート関数
*************************************************/
unsigned char itu2_start(void)
{
	
	ITU2.TCNT = 0;                        // カウントクリア
	ITU.TSTR.BIT.STR2 = 1;                // カウント開始
	
	return 1;
}

/*************************************************
            ITU2ストップ関数
*************************************************/
unsigned char itu2_stop(void)
{
	ITU.TSTR.BIT.STR2 = 0;				//カウント終了
	
	return 1;
}

/*************************************************
            ITU2同期割り込み関数
*************************************************/
void INT_IMIA2(void)
{
	itu2_cnt++;
	ITU.TISRA.BIT.IMFA2 = 0;                // 割り込みステータスフラグクリア
}

/*************************************************
            ITU2結果表示関数
*************************************************/
unsigned char itu2_display(void)
{
	int time = itu2_cnt*10;
	debug_puts("time = ");
	debug_putdec(time);
	debug_puts("ms\n");
	itu2_cnt = 0;					//カウントクリア
	
	return 1;
}